cf_billing/InformationRegisters/энргНастройкаНачисленияГВСМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаНачисленияГВСМКД</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеНачислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСхемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСхемТеплоснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПринадлежностьКТепловомуПункту</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыТепловыхПунктов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаНачисленияГВСМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройку начисления ГВСМКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция НастройкаНачисленияГВСМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкаНачисленияГВСМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация,Район,МКД,Услуга,ТипСхемы,ПринадлежностьКТепловомуПункту";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргНастройкаНачисленияГВСМКДСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Заполняет настройку начисления ГВСМКД коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НастройкаНачисленияГВСМКДКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкаНачисленияГВСМКДКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация,Район,МКД,Услуга,ТипСхемы,ПринадлежностьКТепловомуПункту";
		ИмяТаблицы 					= "НастройкаНачисленияГВСМКД";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса настройка начисления ГВСМКД
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаНастройкаНачисленияГВСМКД() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПредставлениеУслуги КАК ПредставлениеУслуги,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних КАК энргНастройкаНачисленияГВСМКДСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

// Получает тектс запроса настройка начисления ГВСМКДКоллекция периодов
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаНастройкаНачисленияГВСМКДКоллекцияПериодов() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТипСхемы КАК ТипСхемы,
	|	ВложенныйЗапрос.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	НастройкаНачисленияГВСМКД.ПредставлениеУслуги КАК ПредставлениеУслуги,
	|	НастройкаНачисленияГВСМКД.НеНачислять КАК НеНачислять
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		НастройкаНачисленияГВСМКД.Организация КАК Организация,
	|		НастройкаНачисленияГВСМКД.Район КАК Район,
	|		НастройкаНачисленияГВСМКД.МКД КАК МКД,
	|		НастройкаНачисленияГВСМКД.Услуга КАК Услуга,
	|		НастройкаНачисленияГВСМКД.ТипСхемы КАК ТипСхемы,
	|		НастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|		МАКСИМУМ(НастройкаНачисленияГВСМКД.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргНастройкаНачисленияГВСМКД КАК НастройкаНачисленияГВСМКД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО НастройкаНачисленияГВСМКД.Организация = ТаблицаПериодов.Организация
	|				И НастройкаНачисленияГВСМКД.Район = ТаблицаПериодов.Район
	|				И НастройкаНачисленияГВСМКД.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		НастройкаНачисленияГВСМКД.Организация,
	|		НастройкаНачисленияГВСМКД.Район,
	|		НастройкаНачисленияГВСМКД.МКД,
	|		НастройкаНачисленияГВСМКД.Услуга,
	|		НастройкаНачисленияГВСМКД.ТипСхемы,
	|		НастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК НастройкаНачисленияГВСМКД
	|		ПО ВложенныйЗапрос.Организация = НастройкаНачисленияГВСМКД.Организация
	|			И ВложенныйЗапрос.Район = НастройкаНачисленияГВСМКД.Район
	|			И ВложенныйЗапрос.МКД = НастройкаНачисленияГВСМКД.МКД
	|			И ВложенныйЗапрос.Услуга = НастройкаНачисленияГВСМКД.Услуга
	|			И ВложенныйЗапрос.ТипСхемы = НастройкаНачисленияГВСМКД.ТипСхемы
	|			И ВложенныйЗапрос.ПринадлежностьКТепловомуПункту = НастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту
	|			И ВложенныйЗапрос.Период = НастройкаНачисленияГВСМКД.Период";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
